	
	
Функция ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияИБ = АдминистрированиеКластера.ПараметрыАдминистрированияИнформационнойБазыКластера();
	ПараметрыАдминистрированияИБ.ИмяВКластере							= ИнформационнаяБаза.ИмяВКластере;
	ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы		= ИнформационнаяБаза.ИмяАдминистратораИБ;
	ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы	= ИнформационнаяБаза.ПарольАдминистратораИБ;		
	
	Возврат ПараметрыАдминистрированияИБ;
	
КонецФункции

Функция ПолучитьПараметрыИнформационнойБазы(ИнформационнаяБаза) Экспорт
	
	ПараметрыАдминистрированияКластера	= Справочники.КластерСервераПриложений.ПолучитьПараметрыАдминистрированияКластера(ИнформационнаяБаза.Кластер1С);
	ПараметрыАдминистрированияИБ		= ПолучитьПараметрыАдминистрированияИБ(ИнформационнаяБаза);
	
	СвойставаИБ = АдминистрированиеКластера.СвойстваИнформационнойБазы(ПараметрыАдминистрированияИБ, 
																ПараметрыАдминистрированияКластера);
																                 
	Возврат СвойставаИБ;																
																
КонецФункции
